Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.dokku must be replaced
-/+ resource "aws_instance" "dokku" {
      ~ arn                                  = "arn:aws:ec2:us-west-2:663166083306:instance/i-02ee81d4bd0860d30" -> (known after apply)
      ~ associate_public_ip_address          = true -> false # forces replacement
      ~ availability_zone                    = "us-west-2d" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = true -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-02ee81d4bd0860d30" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-002a8247cd4d25be3" -> (known after apply)
      ~ private_dns                          = "ip-172-31-52-88.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.52.88" -> (known after apply)
      ~ public_dns                           = "ec2-52-41-43-100.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.41.43.100" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "launch-wizard-5",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-973c19bf" -> (known after apply)
        tags                                 = {
            "Name" = "dokku.seagl.org"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {
              - "Name" = "dokku.seagl.org /dev/sda1"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-054279bca553e1704" -> null
          - volume_size           = 40 -> null
          - volume_type           = "gp3" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.state,
│   on s3.tf line 1, in resource "aws_s3_bucket" "state":
│    1: resource "aws_s3_bucket" "state" {
│ 
│ Use the aws_s3_bucket_lifecycle_configuration resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.seagl.org/lock?id=SeaGL%252Fseagl-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`